---

_You are currently looking at **version 1.1** of this notebook. To download notebooks and datafiles, as well as get help on Jupyter notebooks in the Coursera platform, visit the [Jupyter Notebook FAQ](https://www.coursera.org/learn/python-data-analysis/resources/0dhYG) course resource._

---

In [7]:
import pandas as pd
import numpy as np
from scipy.stats import ttest_ind

# Assignment 4 - Hypothesis Testing
This assignment requires more individual learning than previous assignments - you are encouraged to check out the [pandas documentation](http://pandas.pydata.org/pandas-docs/stable/) to find functions or methods you might not have used yet, or ask questions on [Stack Overflow](http://stackoverflow.com/) and tag them as pandas and python related. And of course, the discussion forums are open for interaction with your peers and the course staff.

Definitions:
* A _quarter_ is a specific three month period, Q1 is January through March, Q2 is April through June, Q3 is July through September, Q4 is October through December.
* A _recession_ is defined as starting with two consecutive quarters of GDP decline, and ending with two consecutive quarters of GDP growth.
* A _recession bottom_ is the quarter within a recession which had the lowest GDP.
* A _university town_ is a city which has a high percentage of university students compared to the total population of the city.

**Hypothesis**: University towns have their mean housing prices less effected by recessions. Run a t-test to compare the ratio of the mean price of houses in university towns the quarter before the recession starts compared to the recession bottom. (`price_ratio=quarter_before_recession/recession_bottom`)

The following data files are available for this assignment:
* From the [Zillow research data site](http://www.zillow.com/research/data/) there is housing data for the United States. In particular the datafile for [all homes at a city level](http://files.zillowstatic.com/research/public/City/City_Zhvi_AllHomes.csv), ```City_Zhvi_AllHomes.csv```, has median home sale prices at a fine grained level.
* From the Wikipedia page on college towns is a list of [university towns in the United States](https://en.wikipedia.org/wiki/List_of_college_towns#College_towns_in_the_United_States) which has been copy and pasted into the file ```university_towns.txt```.
* From Bureau of Economic Analysis, US Department of Commerce, the [GDP over time](http://www.bea.gov/national/index.htm#gdp) of the United States in current dollars (use the chained value in 2009 dollars), in quarterly intervals, in the file ```gdplev.xls```. For this assignment, only look at GDP data from the first quarter of 2000 onward.

Each function in this assignment below is worth 10%, with the exception of ```run_ttest()```, which is worth 50%.

Definitons From Wikipedia:

- **Gross domestic product (GDP)** is a monetary measure of the market value of all final goods and services produced in a period (quarterly or yearly). 
- **Nominal GDP** estimates are commonly used to determine the economic performance of a whole country or region, and to make international comparisons. 
- **Nominal GDP per capita** does not, however, reflect differences in the cost of living and the inflation rates of the countries; therefore using a GDP PPP per capita basis is arguably more useful when comparing differences in living standards between nations.

Really like this appoach to localizze a pettern inside a colums. In this case to detect when redeccion starts

> Convert the values of the series to a string i.e. ''.join(gdp_b.values) and use str.index() to find the index (ind) of the pattern "0011" then use str.rindex() to find the last occurrence of 1 before the pattern "0011" occurred, adding one to that will give you the position of the start recession. The recession end index will be ind-len(pattern)-1

In [ ]:
# Use this dictionary to map state names to two letter acronyms
states = {'OH': 'Ohio', 'KY': 'Kentucky', 'AS': 'American Samoa', 'NV': 'Nevada', 'WY': 'Wyoming', 'NA': 'National', 'AL': 'Alabama', 'MD': 'Maryland', 'AK': 'Alaska', 'UT': 'Utah', 'OR': 'Oregon', 'MT': 'Montana', 'IL': 'Illinois', 'TN': 'Tennessee', 'DC': 'District of Columbia', 'VT': 'Vermont', 'ID': 'Idaho', 'AR': 'Arkansas', 'ME': 'Maine', 'WA': 'Washington', 'HI': 'Hawaii', 'WI': 'Wisconsin', 'MI': 'Michigan', 'IN': 'Indiana', 'NJ': 'New Jersey', 'AZ': 'Arizona', 'GU': 'Guam', 'MS': 'Mississippi', 'PR': 'Puerto Rico', 'NC': 'North Carolina', 'TX': 'Texas', 'SD': 'South Dakota', 'MP': 'Northern Mariana Islands', 'IA': 'Iowa', 'MO': 'Missouri', 'CT': 'Connecticut', 'WV': 'West Virginia', 'SC': 'South Carolina', 'LA': 'Louisiana', 'KS': 'Kansas', 'NY': 'New York', 'NE': 'Nebraska', 'OK': 'Oklahoma', 'FL': 'Florida', 'CA': 'California', 'CO': 'Colorado', 'PA': 'Pennsylvania', 'DE': 'Delaware', 'NM': 'New Mexico', 'RI': 'Rhode Island', 'MN': 'Minnesota', 'VI': 'Virgin Islands', 'NH': 'New Hampshire', 'MA': 'Massachusetts', 'GA': 'Georgia', 'ND': 'North Dakota', 'VA': 'Virginia'}

In [4]:
def get_list_of_university_towns():
    '''Returns a DataFrame of towns and the states they are in from the 
    university_towns.txt list. The format of the DataFrame should be:
    DataFrame( [ ["Michigan", "Ann Arbor"], ["Michigan", "Yipsilanti"] ], 
    columns=["State", "RegionName"]  )
    
    The following cleaning needs to be done:

    1. For "State", removing characters from "[" to the end.
    2. For "RegionName", when applicable, removing every character from " (" to the end.
    3. Depending on how you read the data, you may need to remove newline character '\n'. '''
    
    return "ANSWER"

In this assigment first is needed some initial looking at the content of the files. In order to get the list of states and region names, it's needed to have additional information prevouly defined.

When the [edit] word appears in the document this mean the state. Following to this states will be the Region name. We have to clean up the university before the bracket. Thiks will be done until next [edit] or state.

In [10]:
# This is the content of the file. I thing the file need to be open as a normal file and parse
"""
Alabama[edit]
Auburn (Auburn University)[1]
Florence (University of North Alabama)
Jacksonville (Jacksonville State University)[2]
Livingston (University of West Alabama)[2]
Montevallo (University of Montevallo)[2]
Troy (Troy University)[2]
Tuscaloosa (University of Alabama, Stillman College, Shelton State)[3][4]
Tuskegee (Tuskegee University)[5]
Alaska[edit]
Fairbanks (University of Alaska Fairbanks)[2]
Arizona[edit]
Flagstaff (Northern Arizona University)[6]
Tempe (Arizona State University)
Tucson (University of Arizona)
Arkansas[edit]
Arkadelphia (Henderson State University, Ouachita Baptist University)[2]
"""

'\nAlabama[edit]\nAuburn (Auburn University)[1]\nFlorence (University of North Alabama)\nJacksonville (Jacksonville State University)[2]\nLivingston (University of West Alabama)[2]\nMontevallo (University of Montevallo)[2]\nTroy (Troy University)[2]\nTuscaloosa (University of Alabama, Stillman College, Shelton State)[3][4]\nTuskegee (Tuskegee University)[5]\nAlaska[edit]\nFairbanks (University of Alaska Fairbanks)[2]\nArizona[edit]\nFlagstaff (Northern Arizona University)[6]\nTempe (Arizona State University)\nTucson (University of Arizona)\nArkansas[edit]\nArkadelphia (Henderson State University, Ouachita Baptist University)[2]\n'

In [18]:
#Function that removes the parenthesis
some_text = "Hello my name is (Javier) and something else ()"
clean_text = []
for c in some_text:
    if c == "(":
        break
    else:
        clean_text.append(c)
print(clean_text)
my_text = "".join(clean_text)
my_text.strip()

['H', 'e', 'l', 'l', 'o', ' ', 'm', 'y', ' ', 'n', 'a', 'm', 'e', ' ', 'i', 's', ' ']

'Hello my name is'

In [17]:
some_text = "Flagstaff (Northern Arizona University)[6]"
# Not let's do more simple
clean_text = some_text.split("(")[0].strip()
print(clean_text)

Flagstaff

## Check for States with NaN or Unknow values...

In [18]:
# Read the file and create the dataframe with the states and towns.
towns = []
# This function will take each state
with open('university_towns.txt', 'r+') as file:
    state = "Unknown"
    # Read the 
    for line in file:
        if "[edit]" in line:
            state = line.split("[")[0].strip()
        else:
            # Get the country and store into the Dictionary for the dataframe
            towns.append([state, line.split("(")[0].strip()])
df = pd.DataFrame(towns, columns=["State", "RegionName"])
df.groupby(by="State").count()
# This is to see if there is something strange in the data.

                RegionName
State
Alabama                  8
Alaska                   1
Arizona                  3
Arkansas                 8
California              25
Colorado                 9
Connecticut              7
Delaware                 2
Florida                 12
Georgia                 16
Hawaii                   1
Idaho                    3
Illinois                10
Indiana                 13
Iowa                    13
Kansas                   6
Kentucky                11
Louisiana                8
Maine                    9
Maryland                10
Massachusetts           19
Michigan                20
Minnesota               14
Mississippi              5
Missouri                 9
Montana                  3
Nebraska                 7
Nevada                   2
New Hampshire            7
New Jersey              10
New Mexico               5
New York                31
North Carolina          18
North Dakota             2
Ohio                    22
Oklahoma                11
Oregon                  10
Pennsylvania            43
Rhode Island             2
South Carolina          11
South Dakota             4
Tennessee               13
Texas                   22
Utah                     6
Vermont                  6
Virginia                12
Washington               5
West Virginia            9
Wisconsin               13
Wyoming                  1

In previous list you can see the count of the towns grouped by state. In this table we would be able to see if there are some wrong values with 0 or unknown states... so we can clean the values posrteriously.

In [8]:
def get_list_of_university_towns():
    # Let's create a new variable for all the values
    towns = []
    # Read the file
    with open('university_towns.txt', 'r+') as file:
        state = "Unknown"
        # Read the 
        for line in file:
            if "[edit]" in line:
                state = line.split("[")[0].strip()
            else:
                # Get the country and store into the Dictionary for the dataframe
                towns.append([state, line.split("(")[0].strip()])
    # Create a dataframe using the data read
    return pd.DataFrame(towns, columns=["State", "RegionName"])

In [9]:
get_list_of_university_towns().head()

     State    RegionName
0  Alabama        Auburn
1  Alabama      Florence
2  Alabama  Jacksonville
3  Alabama    Livingston
4  Alabama    Montevallo

In order to get the rececion I have to read the file gdplev.xls

The next three function I will need to read this file and convert it into a data frame. Then I will use the same dataframe to return the values requested

In [57]:
?pd.read_excel

In [98]:
excel = pd.ExcelFile("gdplev.xls")
excel.sheet_names

['Sheet1']

In [66]:
? excel.parse

In [99]:
GDP = excel.parse(excel.sheet_names[0],names=["QuarterYear","Current","Chained"],skiprows=7, parse_cols="E:G")

In [88]:
GDP.head()

  QuarterYear  Current  Chained
0      1947q1    243.1   1934.5
1      1947q2    246.3   1932.3
2      1947q3    250.1   1930.3
3      1947q4    260.3   1960.7
4      1948q1    266.2   1989.5

In [89]:
GDP.tail()

    QuarterYear  Current  Chained
273      2015q2  17998.3  16374.2
274      2015q3  18141.9  16454.9
275      2015q4  18222.8  16490.7
276      2016q1  18281.6  16525.0
277      2016q2  18450.1  16583.1

In [12]:
GDP["Year"] = GDP["QuarterYear"].map(lambda cell: cell.split("q")[0])
GDP["Quarter"] = GDP["QuarterYear"].map(lambda cell: cell.split("q")[1])
GDP.drop("QuarterYear",axis = 1, inplace = True)

In [13]:
GDP.head()

   Current  Chained  Year Quarter
0    243.1   1934.5  1947       1
1    246.3   1932.3  1947       2
2    250.1   1930.3  1947       3
3    260.3   1960.7  1947       4
4    266.2   1989.5  1948       1

In [15]:
GDP.set_index(["Year","Quarter"]).head()

              Current  Chained
Year Quarter
1947 1          243.1   1934.5
     2          246.3   1932.3
     3          250.1   1930.3
     4          260.3   1960.7
1948 1          266.2   1989.5

In [117]:
# Ge the new columns names
columns = ["Q1","Q2","Q3","Q4"]
# Get the new indexes
index = GDP["Year"].unique()
#newGDP = pd.DataFrame()

In [120]:
index

array(['1947', '1948', '1949', '1950', '1951', '1952', '1953', '1954',
       '1955', '1956', '1957', '1958', '1959', '1960', '1961', '1962',
       '1963', '1964', '1965', '1966', '1967', '1968', '1969', '1970',
       '1971', '1972', '1973', '1974', '1975', '1976', '1977', '1978',
       '1979', '1980', '1981', '1982', '1983', '1984', '1985', '1986',
       '1987', '1988', '1989', '1990', '1991', '1992', '1993', '1994',
       '1995', '1996', '1997', '1998', '1999', '2000', '2001', '2002',
       '2003', '2004', '2005', '2006', '2007', '2008', '2009', '2010',
       '2011', '2012', '2013', '2014', '2015', '2016'], dtype=object)

In [135]:
GDP.head()

   Current  Chained  Year Quarter
0    243.1   1934.5  1947       1
1    246.3   1932.3  1947       2
2    250.1   1930.3  1947       3
3    260.3   1960.7  1947       4
4    266.2   1989.5  1948       1

In [138]:
# This is not integer so it cannot be compared
GDP["Quarter"].head()

0    1
1    2
2    3
3    4
4    1
Name: Quarter, dtype: object

In [143]:
GDP["Quarter"] = pd.to_numeric(GDP["Quarter"], errors='ignore')

In [144]:
GDP.head()

   Current  Chained  Year  Quarter
0    243.1   1934.5  1947        1
1    246.3   1932.3  1947        2
2    250.1   1930.3  1947        3
3    260.3   1960.7  1947        4
4    266.2   1989.5  1948        1

In [146]:
values = [GDP[GDP["Quarter"] == 1],GDP[GDP["Quarter"] == 2],GDP[GDP["Quarter"] == 3],GDP[GDP["Quarter"] == 4]]

In [159]:
values = zip(GDP[GDP["Quarter"] == 1].loc[:,"Chained"].values,
GDP[GDP["Quarter"] == 2].loc[:,"Chained"].values,
GDP[GDP["Quarter"] == 3].loc[:,"Chained"].values,
GDP[GDP["Quarter"] == 4].loc[:,"Chained"].values)

In [156]:
?pd.DataFrame

In [168]:
transDF = pd.DataFrame(list(values), index = index, columns = columns)
transDF = pd.DataFrame(list(values), columns = columns)

transDF.head()

## START FROM HERE FUNCTIONS 2 TO 4

In [21]:
import pandas as pd
import numpy as np
from scipy.stats import ttest_ind

excel = pd.ExcelFile("gdplev.xls")
excel.sheet_names
GDP = excel.parse(excel.sheet_names[0],names=["QuarterYear","GDP"],skiprows=7, parse_cols="E,G")

In [32]:
GDP.head()

  QuarterYear     GDP  Year
0      1947q1  1934.5  1947
1      1947q2  1932.3  1947
2      1947q3  1930.3  1947
3      1947q4  1960.7  1947
4      1948q1  1989.5  1948

Clean the data prior 2000.
Create a new column with only the year to filter on the the infornmation to only take into account years from 2000

In [28]:
# Split the columns quarter year into year
GDP["Year"] = GDP["QuarterYear"].map(lambda cell: cell.split("q")[0])
# Convert to numeric values
GDP["Year"] = pd.to_numeric(GDP["Year"])

In [30]:
GDPFrom2000 = GDP[GDP["Year"] >= 2000]

In [34]:
GDPFrom2000.head()

    QuarterYear      GDP  Year
212      2000q1  12359.1  2000
213      2000q2  12592.5  2000
214      2000q3  12607.7  2000
215      2000q4  12679.3  2000
216      2001q1  12643.3  2001

Now we can let's start to get the recesions periods. I can create a nuew columns with the recesion start and end from the current quarters in the dataframe.

In [37]:
GDPFrom2000 = GDP[GDP["Year"] >= 1999]

In [39]:
GDPFrom2000.head()

    QuarterYear      GDP  Year
208      1999q1  11864.7  1999
209      1999q2  11962.5  1999
210      1999q3  12113.1  1999
211      1999q4  12323.3  1999
212      2000q1  12359.1  2000

Tom start computing the year from 2000 I need to have prior data to be able to start counting recession periods... so I will start from the year 2000 but I will take into consideration prior epochs from 2000. Starting from 1999 in this case.

To sumarize, to know where a recesion start I need to take into account the last four quarter periods. If the pattern follows the recession definition the we mark that year as recession = true. else we will marke down that period as false.

A recession is defined as starting with two consecutive quarters of GDP decline, and ending with two consecutive quarters of GDP growth.

    For each element i:
    
        take the elements i-4 ?
 
        take the elements i-3
        take the elements i-2
        take the elements i-1
        take the elements current i
    
        -> PART 1 : Check  "starting with two consecutive quarters of GDP decline"
    
        BY DEFAULT THE RECESION IS FALSE
    
        if element[i-3] <  element[i-4] &&   element[i-2] <  element[i-3] ]:
            Two quarters consecutively in GDP decline.
       
            -> PART IIa : two consecutive quarters of GDP growth. Check wheter is growing from the previous quarter
            if ( element[i-1 > i-2 ]):
                -> This is the second part of the recession when it grows ups
                -> PART IIb : two consecutive quarters of GDP growth.
                if element[i-1] >  element[i] :
                    -> this means the recesion starts
                    START RECESION
    
            
        -A SET RECESION FROM THIS QUARTER BEING COMPUTING.

Once I have get the pseuodo code I need to get the information element by element from the previous 4 quarters. The I could apply a function for the following series

In [60]:
GDP["GDP"].head()
GDP["GDP"].iloc[0:4]

0    1934.5
1    1932.3
2    1930.3
3    1960.7
Name: GDP, dtype: float64

In [61]:
GDP["GDP"].iloc[0:4]

0    1934.5
1    1932.3
2    1930.3
3    1960.7
Name: GDP, dtype: float64

In [66]:
len(GDP["GDP"])

278

In [78]:
GDP["LastQuarters"] = np.NaN

In [79]:
GDP.head()

  QuarterYear     GDP  Year  LastQuarters
0      1947q1  1934.5  1947           NaN
1      1947q2  1932.3  1947           NaN
2      1947q3  1930.3  1947           NaN
3      1947q4  1960.7  1947           NaN
4      1948q1  1989.5  1948           NaN

In [76]:
# This works
#GDP.ix[i, "LastQuarters"] = values

In [113]:
for i in range(4, len(GDP["GDP"])):
    #GDP.ix[i, "LastQuarters"] = GDP["GDP"].iloc[i-4:i].values  
    #GDP.ix[i, "LastQuarters"] = "Test"
    #print(GDP["GDP"].iloc[i-4:i].values)
    values = GDP["GDP"].iloc[i-4:i].values  
    print(list(values))
    #GDP.ix[i, "LastQuarters"] = values
    #GDP.ix[i, "LastQuarters"] = "Test"
    GDP.ix[i, "LastQuarters"] = list(values)

[1934.5, 1932.3, 1930.3, 1960.7]

ValueError: Must have equal len keys and value when setting with an iterable

In [98]:
mGDP = GDP.head()
mGDP["GDP1"] = 0
mGDP["GDP2"] = 0

C:\Users\javier.santos\AppData\Local\Continuum\Anaconda3\lib\site-packages\ipykernel\__main__.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  from ipykernel import kernelapp as app
C:\Users\javier.santos\AppData\Local\Continuum\Anaconda3\lib\site-packages\ipykernel\__main__.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  app.launch_new_instance()

In [100]:
mGDP.head()

  QuarterYear     GDP  Year LastQuarters  GDP1  GDP2
0      1947q1  1934.5  1947          NaN     0     0
1      1947q2  1932.3  1947          NaN     0     0
2      1947q3  1930.3  1947          NaN     0     0
3      1947q4  1960.7  1947          NaN     0     0
4      1948q1  1989.5  1948         Test     0     0

In [102]:
mGDP[["GDP1","GDP2"]] = 1

C:\Users\javier.santos\AppData\Local\Continuum\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  if __name__ == '__main__':
C:\Users\javier.santos\AppData\Local\Continuum\Anaconda3\lib\site-packages\pandas\core\indexing.py:465: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self.obj[item] = s

In [104]:
mGDP.head(10)

  QuarterYear     GDP  Year LastQuarters  GDP1  GDP2
0      1947q1  1934.5  1947          NaN     1     1
1      1947q2  1932.3  1947          NaN     1     1
2      1947q3  1930.3  1947          NaN     1     1
3      1947q4  1960.7  1947          NaN     1     1
4      1948q1  1989.5  1948         Test     1     1

In [106]:
mGDP[["GDP1","GDP2"]] = ["Hola", "Adios"]

C:\Users\javier.santos\AppData\Local\Continuum\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  if __name__ == '__main__':
C:\Users\javier.santos\AppData\Local\Continuum\Anaconda3\lib\site-packages\pandas\core\indexing.py:465: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self.obj[item] = s

In [108]:
mGDP.head(10)

  QuarterYear     GDP  Year LastQuarters  GDP1   GDP2
0      1947q1  1934.5  1947          NaN  Hola  Adios
1      1947q2  1932.3  1947          NaN  Hola  Adios
2      1947q3  1930.3  1947          NaN  Hola  Adios
3      1947q4  1960.7  1947          NaN  Hola  Adios
4      1948q1  1989.5  1948         Test  Hola  Adios

In [110]:
mGDP.ix[2,["GDP1","GDP2"]] = ["Javier", "Marcos"]

C:\Users\javier.santos\AppData\Local\Continuum\Anaconda3\lib\site-packages\pandas\core\indexing.py:465: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self.obj[item] = s

In [111]:
mGDP.head()

  QuarterYear     GDP  Year LastQuarters    GDP1    GDP2
0      1947q1  1934.5  1947          NaN    Hola   Adios
1      1947q2  1932.3  1947          NaN    Hola   Adios
2      1947q3  1930.3  1947          NaN  Javier  Marcos
3      1947q4  1960.7  1947          NaN    Hola   Adios
4      1948q1  1989.5  1948         Test    Hola   Adios

In [88]:
GDP.head(10)

  QuarterYear     GDP  Year LastQuarters
0      1947q1  1934.5  1947          NaN
1      1947q2  1932.3  1947          NaN
2      1947q3  1930.3  1947          NaN
3      1947q4  1960.7  1947          NaN
4      1948q1  1989.5  1948         Test
5      1948q2  2021.9  1948         Test
6      1948q3  2033.2  1948         Test
7      1948q4  2035.3  1948         Test
8      1949q1  2007.5  1949         Test
9      1949q2  2000.8  1949         Test

It seems Pandas doesn't allow to set a list into the cells so the data must be cplitted into columns

In [115]:
values =

In [119]:
print([list(values)]*4)

[[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22]]

In [133]:
# First I need to create the columns. 
# In order to do this I will create a new data frame with the four columns to check
columns = ["i-4","i-3","i-2","i-1"]
values = [[np.NaN,np.NaN,np.NaN,np.NaN]] * (len(GDP["GDP"]) )
new_columns = pd.DataFrame(values, columns = columns)

In [134]:
new_columns.head()

   i-4  i-3  i-2  i-1
0  NaN  NaN  NaN  NaN
1  NaN  NaN  NaN  NaN
2  NaN  NaN  NaN  NaN
3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN

In [136]:
for i in range(4, len(GDP["GDP"])):
    new_columns.ix[i, columns] = GDP["GDP"].iloc[i-4:i].values

In [138]:
new_columns.head()

      i-4     i-3     i-2     i-1
0     NaN     NaN     NaN     NaN
1     NaN     NaN     NaN     NaN
2     NaN     NaN     NaN     NaN
3     NaN     NaN     NaN     NaN
4  1934.5  1932.3  1930.3  1960.7

In [144]:
merged = pd.concat([GDP,new_columns], axis = 1 )

In [146]:
merged.head()

  QuarterYear     GDP  Year LastQuarters     i-4     i-3     i-2     i-1
0      1947q1  1934.5  1947          NaN     NaN     NaN     NaN     NaN
1      1947q2  1932.3  1947          NaN     NaN     NaN     NaN     NaN
2      1947q3  1930.3  1947          NaN     NaN     NaN     NaN     NaN
3      1947q4  1960.7  1947          NaN     NaN     NaN     NaN     NaN
4      1948q1  1989.5  1948         Test  1934.5  1932.3  1930.3  1960.7

I have managed to create new columns with the last 4 quarters in order to cumpute the reccesion

Now I should iterate over the rows and performing some iterations to compute the recession start. 
This will be done follwoing the pseudocode previously done.

http://stackoverflow.com/questions/41361537/find-two-consecutive-quarters-of-gdp-decline-and-ending-with-two-consecutive-qu

http://stackoverflow.com/questions/41537655/pandas-determine-the-start-end-and-bottom-of-recession-based-on-gdp

In [160]:
printFunction = lambda x: print(x)

In [163]:
# Followning function will apply a function by row isntead by columns
# the function will return a serie with the entire row
#merged.apply(printFunction,axis = 1)

In [197]:
# Let's create a new colums
merged["start"] = False

In [214]:
def check_reccession(row):
    """
       BY DEFAULT THE RECESION IS FALSE

    if element[i-3] <  element[i-4] &&   element[i-2] <  element[i-3] ]:
        Two quarters consecutively in GDP decline.

        -> PART IIa : two consecutive quarters of GDP growth. Check wheter is growing from the previous quarter
        if ( element[i-1 > i-2 ]):
            -> This is the second part of the recession when it grows ups
            -> PART IIb : two consecutive quarters of GDP growth.
            if element[i-1] >  element[i] :
                -> this means the recesion starts
                START RECESION


    -A SET RECESION FROM THIS QUARTER BEING COMPUTED.
    """
    # By default the recesion is set to False
    result = False
    
    if (row["i-3"] < row["i-4"]) and (row["i-2"] < row["i-3"]) and \
       (row["i-1"] > row["i-2"]) and (row["i-1"] > row["GDP"]):
        result = True
    
    # Set the final result 
    row["start"] = result
    return row
    #print(row)

In [215]:
merged.head()

,QuarterYear,GDP,Year,LastQuarters,i-4,i-3,i-2,i-1,start
0,1947q1,1934.5,1947,NaN,NaN,NaN,NaN,NaN,False
1,1947q2,1932.3,1947,NaN,NaN,NaN,NaN,NaN,False
2,1947q3,1930.3,1947,NaN,NaN,NaN,NaN,NaN,False
3,1947q4,1960.7,1947,NaN,NaN,NaN,NaN,NaN,False
4,1948q1,1989.5,1948,Test,1934.5,1932.3,1930.3,1960.7,False

In [225]:
merged.apply(check_reccession,axis = 1)

,QuarterYear,GDP,Year,LastQuarters,i-4,i-3,i-2,i-1,start
0,1947q1,1934.5,1947,NaN,NaN,NaN,NaN,NaN,False
1,1947q2,1932.3,1947,NaN,NaN,NaN,NaN,NaN,False
2,1947q3,1930.3,1947,NaN,NaN,NaN,NaN,NaN,False
3,1947q4,1960.7,1947,NaN,NaN,NaN,NaN,NaN,False
4,1948q1,1989.5,1948,Test,1934.5,1932.3,1930.3,1960.7,False
5,1948q2,2021.9,1948,Test,1932.3,1930.3,1960.7,1989.5,False
6,1948q3,2033.2,1948,Test,1930.3,1960.7,1989.5,2021.9,False
7,1948q4,2035.3,1948,Test,1960.7,1989.5,2021.9,2033.2,False
8,1949q1,2007.5,1949,Test,1989.5,2021.9,2033.2,2035.3,False
9,1949q2,2000.8,1949,Test,2021.9,2033.2,2035.3,2007.5,False
10,1949q3,2022.8,1949,Test,2033.2,2035.3,2007.5,2000.8,False
11,1949q4,2004.7,1949,Test,2035.3,2007.5,2000.8,2022.8,True
12,1950q1,2084.6,1950,Test,2007.5,2000.8,2022.8,2004.7,False
13,1950q2,2147.6,1950,Test,2000.8,2022.8,2004.7,2084.6,False
14,1950q3,2230.4,1950,Test,2022.8,2004.7,2084.6,2147.6,False
15,1950q4,2273.4,1950,Test,2004.7,2084.6,2147.6,2230.4,False
16,1951q1,2304.5,1951,Test,2084.6,2147.6,2230.4,2273.4,False
17,1951q2,2344.5,1951,Test,2147.6,2230.4,2273.4,2304.5,False
18,1951q3,2392.8,1951,Test,2230.4,2273.4,2304.5,2344.5,False
19,1951q4,2398.1,1951,Test,2273.4,2304.5,2344.5,2392.8,False
20,1952q1,2423.5,1952,Test,2304.5,2344.5,2392.8,2398.1,False
21,1952q2,2428.5,1952,Test,2344.5,2392.8,2398.1,2423.5,False
22,1952q3,2446.1,1952,Test,2392.8,2398.1,2423.5,2428.5,False
23,1952q4,2526.4,1952,Test,2398.1,2423.5,2428.5,2446.1,False
24,1953q1,2573.4,1953,Test,2423.5,2428.5,2446.1,2526.4,False
25,1953q2,2593.5,1953,Test,2428.5,2446.1,2526.4,2573.4,False
26,1953q3,2578.9,1953,Test,2446.1,2526.4,2573.4,2593.5,False
27,1953q4,2539.8,1953,Test,2526.4,2573.4,2593.5,2578.9,False
28,1954q1,2528.0,1954,Test,2573.4,2593.5,2578.9,2539.8,False
29,1954q2,2530.7,1954,Test,2593.5,2578.9,2539.8,2528.0,False
...,...,...,...,...,...,...,...,...,...
248,2009q1,14375.0,2009,Test,14889.5,14963.4,14891.6,14577.0,False
249,2009q2,14355.6,2009,Test,14963.4,14891.6,14577.0,14375.0,False
250,2009q3,14402.5,2009,Test,14891.6,14577.0,14375.0,14355.6,False
251,2009q4,14541.9,2009,Test,14577.0,14375.0,14355.6,14402.5,False
252,2010q1,14604.8,2010,Test,14375.0,14355.6,14402.5,14541.9,False
253,2010q2,14745.9,2010,Test,14355.6,14402.5,14541.9,14604.8,False
254,2010q3,14845.5,2010,Test,14402.5,14541.9,14604.8,14745.9,False
255,2010q4,14939.0,2010,Test,14541.9,14604.8,14745.9,14845.5,False
256,2011q1,14881.3,2011,Test,14604.8,14745.9,14845.5,14939.0,False
257,2011q2,14989.6,2011,Test,14745.9,14845.5,14939.0,14881.3,False
258,2011q3,15021.1,2011,Test,14845.5,14939.0,14881.3,14989.6,False
259,2011q4,15190.3,2011,Test,14939.0,14881.3,14989.6,15021.1,False
260,2012q1,15291.0,2012,Test,14881.3,14989.6,15021.1,15190.3,False
261,2012q2,15362.4,2012,Test,14989.6,15021.1,15190.3,15291.0,False
262,2012q3,15380.8,2012,Test,15021.1,15190.3,15291.0,15362.4,False
263,2012q4,15384.3,2012,Test,15190.3,15291.0,15362.4,15380.8,False
264,2013q1,15491.9,2013,Test,15291.0,15362.4,15380.8,15384.3,False
265,2013q2,15521.6,2013,Test,15362.4,15380.8,15384.3,15491.9,False
266,2013q3,15641.3,2013,Test,15380.8,15384.3,15491.9,15521.6,False
267,2013q4,15793.9,2013,Test,15384.3,15491.9,15521.6,15641.3,False
268,2014q1,15747.0,2014,Test,15491.9,15521.6,15641.3,15793.9,False
269,2014q2,15900.8,2014,Test,15521.6,15641.3,15793.9,15747.0,False
270,2014q3,16094.5,2014,Test,15641.3,15793.9,15747.0,15900.8,False
271,2014q4,16186.7,2014,Test,15793.9,15747.0,15900.8,16094.5,False
272,2015q1,16269.0,2015,Test,15747.0,15900.8,16094.5,16186.7,False
273,2015q2,16374.2,2015,Test,15900.8,16094.5,16186.7,16269.0,False
274,2015q3,16454.9,2015,Test,16094.5,16186.7,16269.0,16374.2,False
275,2015q4,16490.7,2015,Test,16186.7,16269.0,16374.2,16454.9,False
276,2016q1,16525.0,2016,Test,16269.0,16374.2,16454.9,16490.7,False
277,2016q2,16583.1,2016,Test,16374.2,16454.9,16490.7,16525.0,False

In [228]:
mymerged = merged.apply(check_reccession,axis = 1)
mymerged[mymerged["start"]==True]

,QuarterYear,GDP,Year,LastQuarters,i-4,i-3,i-2,i-1,start
11,1949q4,2004.7,1949,Test,2035.3,2007.5,2000.8,2022.8,True
142,1982q3,6486.8,1982,Test,6662.9,6585.1,6475.0,6510.2,True

In [254]:
# Open the Excel file
excel = pd.ExcelFile("gdplev.xls")
# Form the first sheet only take the columns E and G with the quarter and chained GDP 
GDP = excel.parse(excel.sheet_names[0],names=["QuarterYear","GDP"],skiprows=7, parse_cols="E,G")
# Split the columns quarter year into year
GDP["Year"] = GDP["QuarterYear"].map(lambda cell: cell.split("q")[0])
# Convert to numeric (floa, integer or wathever) values from columns Year and Quarter
GDP["Year"] = pd.to_numeric(GDP["Year"])
GDP["GDP"] = pd.to_numeric(GDP["GDP"])
# Filter the values from 2000 (we also need previous year to compute the recession for the first year)
GDP = GDP[GDP["Year"] >= 1999]
# Reset the index and delete the old one.
GDP.reset_index(drop=True,inplace=True)
GDP.head(10)

  QuarterYear      GDP  Year
0      1999q1  11864.7  1999
1      1999q2  11962.5  1999
2      1999q3  12113.1  1999
3      1999q4  12323.3  1999
4      2000q1  12359.1  2000
5      2000q2  12592.5  2000
6      2000q3  12607.7  2000
7      2000q4  12679.3  2000
8      2001q1  12643.3  2001
9      2001q2  12710.3  2001

In [255]:
# Create new columns with the last 4 quarters in order to cumpute the reccesion
columns = ["i-4","i-3","i-2","i-1"]
values = [[np.NaN,np.NaN,np.NaN,np.NaN]] * (len(GDP["GDP"]) )
new_columns = pd.DataFrame(values, columns = columns)
new_columns.head()

   i-4  i-3  i-2  i-1
0  NaN  NaN  NaN  NaN
1  NaN  NaN  NaN  NaN
2  NaN  NaN  NaN  NaN
3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN

In [256]:
# Add to the columns the data from GDP
for i in range(4, len(GDP["GDP"])):
    new_columns.ix[i, columns] = GDP["GDP"].iloc[i-4:i].values  
#Merge the new columns with the GDO set from 2000	
GDP = pd.concat([GDP,new_columns], axis = 1 )
GDP.head(10)

  QuarterYear      GDP  Year      i-4      i-3      i-2      i-1
0      1999q1  11864.7  1999      NaN      NaN      NaN      NaN
1      1999q2  11962.5  1999      NaN      NaN      NaN      NaN
2      1999q3  12113.1  1999      NaN      NaN      NaN      NaN
3      1999q4  12323.3  1999      NaN      NaN      NaN      NaN
4      2000q1  12359.1  2000  11864.7  11962.5  12113.1  12323.3
5      2000q2  12592.5  2000  11962.5  12113.1  12323.3  12359.1
6      2000q3  12607.7  2000  12113.1  12323.3  12359.1  12592.5
7      2000q4  12679.3  2000  12323.3  12359.1  12592.5  12607.7
8      2001q1  12643.3  2001  12359.1  12592.5  12607.7  12679.3
9      2001q2  12710.3  2001  12592.5  12607.7  12679.3  12643.3

In [275]:
# Open the Excel file
excel = pd.ExcelFile("gdplev.xls")
# Form the first sheet only take the columns E and G with the quarter and chained GDP 
GDP = excel.parse(excel.sheet_names[0],names=["QuarterYear","GDP"],skiprows=7, parse_cols="E,G")
# Split the columns quarter year into year
GDP["Year"] = GDP["QuarterYear"].map(lambda cell: cell.split("q")[0])
# Convert to numeric (floa, integer or wathever) values from columns Year and Quarter
GDP["Year"] = pd.to_numeric(GDP["Year"])
GDP["GDP"] = pd.to_numeric(GDP["GDP"])
# Filter the values from 2000 (we also need previous year to compute the recession for the first year)
GDP = GDP[GDP["Year"] >= 1999]
# Reset the index and delete the old one.
GDP.reset_index(drop=True,inplace=True)
# Create new columns with the last 4 quarters in order to cumpute the reccesion
columns = ["i-4","i-3","i-2","i-1"]
values = [[np.NaN,np.NaN,np.NaN,np.NaN]] * (len(GDP["GDP"]) )
new_columns = pd.DataFrame(values, columns = columns)
# Add to the columns the data from GDP
for i in range(4, len(GDP["GDP"])):
    new_columns.ix[i, columns] = GDP["GDP"].iloc[i-4:i].values  
#Merge the new columns with the GDO set from 2000	
GDP = pd.concat([GDP,new_columns], axis = 1 )

## Let's create a new column with recession periods
GDP["recession"] = False

In [277]:



# Apply recession function to the dataframe by row
GDP = GDP.apply(check_reccession,axis = 1)
# Check the results
#GDP.head(40)
GDP[GDP["recession"]==True]

   QuarterYear      GDP  Year      i-4      i-3      i-2      i-1 recession
41      2009q2  14355.6  2009  14963.4  14891.6  14577.0  14375.0      True
42      2009q3  14402.5  2009  14891.6  14577.0  14375.0  14355.6      True
43      2009q4  14541.9  2009  14577.0  14375.0  14355.6  14402.5      True

In [291]:
## Recession definition
def check_reccession(row):
    # By default the recesion is set to False
    result = False
    if (row["i-3"] < row["i-4"]) and (row["i-2"] < row["i-3"]):
        result = True
    # Set the final result 
    row["recession"] = result
    return row

def get_GDP():
    # Open the Excel file
    excel = pd.ExcelFile("gdplev.xls")
    # Form the first sheet only take the columns E and G with the quarter and chained GDP 
    GDP = excel.parse(excel.sheet_names[0],names=["QuarterYear","GDP"],skiprows=7, parse_cols="E,G")
    # Split the columns quarter year into year
    GDP["Year"] = GDP["QuarterYear"].map(lambda cell: cell.split("q")[0])
    # Convert to numeric (floa, integer or wathever) values from columns Year and Quarter
    GDP["Year"] = pd.to_numeric(GDP["Year"])
    GDP["GDP"] = pd.to_numeric(GDP["GDP"])
    # Filter the values from 2000 (we also need previous year to compute the recession for the first year)
    GDP = GDP[GDP["Year"] >= 1999]
    # Reset the index and delete the old one.
    GDP.reset_index(drop=True,inplace=True)
    # Create new columns with the last 4 quarters in order to cumpute the reccesion
    columns = ["i-4","i-3","i-2","i-1"]
    values = [[np.NaN,np.NaN,np.NaN,np.NaN]] * (len(GDP["GDP"]) )
    new_columns = pd.DataFrame(values, columns = columns)
    # Add to the columns the data from GDP
    for i in range(4, len(GDP["GDP"])):
        new_columns.ix[i, columns] = GDP["GDP"].iloc[i-4:i].values  
    #Merge the new columns with the GDO set from 2000	
    GDP = pd.concat([GDP,new_columns], axis = 1 )
    #Once both set have been merged, et the index
    GDP.set_index("QuarterYear", inplace=True)
    ## Let's create a new column with recession periods
    GDP["recession"] = False
    # Apply recession function to the dataframe by row
    return GDP.apply(check_reccession,axis = 1)

In [300]:
# Check the results
GDP = get_GDP()
GDP[GDP["recession"]==True]

                 GDP  Year      i-4      i-3      i-2      i-1 recession
QuarterYear
2009q2       14355.6  2009  14963.4  14891.6  14577.0  14375.0      True
2009q3       14402.5  2009  14891.6  14577.0  14375.0  14355.6      True
2009q4       14541.9  2009  14577.0  14375.0  14355.6  14402.5      True

In [310]:
GDP = get_GDP()
recGDP = GDP[GDP["recession"]==True]
bottom = GDP.index.get_loc(recGDP["GDP"].argmin())
GDP.index[bottom- 3]

'2008q3'

In [306]:
recGDP.index

Index(['2009q2', '2009q3', '2009q4'], dtype='object', name='QuarterYear')

In [311]:
def get_recession_start():
    GDP = get_GDP()
    recGDP = GDP[GDP["recession"]==True]
    bottom = GDP.index.get_loc(recGDP["GDP"].argmin())
    return GDP.index[bottom- 3]

In [312]:
get_recession_start()

'2008q3'

In [298]:
def get_recession_end():
    '''Returns the year and quarter of the recession bottom time as a 
    string value in a format such as 2005q3'''
    GDP = get_GDP()
    recGDP = GDP[GDP["recession"]==True]
    return recGDP["GDP"].argmax()

In [299]:
get_recession_end()

'2009q4'

In [295]:
def get_recession_bottom():
    '''Returns the year and quarter of the recession bottom time as a 
    string value in a format such as 2005q3'''
    GDP = get_GDP()
    recGDP = GDP[GDP["recession"]==True]
    return recGDP["GDP"].argmin()

In [296]:
get_recession_bottom()

'2009q2'

In [313]:
def convert_housing_data_to_quarters():
    '''Converts the housing data to quarters and returns it as mean 
    values in a dataframe. This dataframe should be a dataframe with
    columns for 2000q1 through 2016q3, and should have a multi-index
    in the shape of ["State","RegionName"].
    
    Note: Quarters are defined in the assignment description, they are
    not arbitrary three month periods.
    
    The resulting dataframe should have 67 columns, and 10,730 rows.
    '''
    
    return "ANSWER"

## Now let's read the next file City_Zhvi_AllHomes.csv

In [60]:
homes = pd.read_csv("City_Zhvi_AllHomes.csv")

In [61]:
homes.head()

,RegionID,RegionName,State,Metro,CountyName,SizeRank,1996-04,1996-05,1996-06,1996-07,...,2015-11,2015-12,2016-01,2016-02,2016-03,2016-04,2016-05,2016-06,2016-07,2016-08
0,6181,New York,NY,New York,Queens,1,nan,nan,nan,nan,...,573600,576200,578400,582200,588000,592200,592500,590200,588000,586400
1,12447,Los Angeles,CA,Los Angeles-Long Beach-Anaheim,Los Angeles,2,155000.00,154600.00,154400.00,154200.00,...,558200,560800,562800,565600,569700,574000,577800,580600,583000,585100
2,17426,Chicago,IL,Chicago,Cook,3,109700.00,109400.00,109300.00,109300.00,...,207800,206900,206200,205800,206200,207300,208200,209100,211000,213000
3,13271,Philadelphia,PA,Philadelphia,Philadelphia,4,50000.00,49900.00,49600.00,49400.00,...,122300,121600,121800,123300,125200,126400,127000,127400,128300,129100
4,40326,Phoenix,AZ,Phoenix,Maricopa,5,87200.00,87700.00,88200.00,88400.00,...,183800,185300,186600,188000,189100,190200,191300,192800,194500,195900

In [346]:
# Let's loop from 2000 to 2016
for year in range(2000,2017):
    # Let's loop over the four quarters per year
    for quarter in range(0,4):
        #Let's loop over the 12/4 = 3 mothns per quarter
        for  month in range(0,3):
            #print("{}-{}->{}".format(year,(month+1)*(quarter+1),quarter))
            #Check if data
            pass

In [33]:
# Let's loop from 2000 to 2016
for year in range(2000,2017):
    # Let's loop over the four quarters per year
    for quarter in range(0,4):
        # 12/4 = 3 mothns per quarter
        #print( + ":" + str(year)+"-"+str((quarter+1)*3).zfill(2))
        # str(year)+"-"+str((quarter*3)+1).zfill(2):str(year)+"-"+str((quarter+1)*3).zfill(2)
        months = [str(year)+"-"+str((quarter * 3) + month).zfill(2) for month in range(1,4)]
        print(months)

['2000-01', '2000-02', '2000-03']
['2000-04', '2000-05', '2000-06']
['2000-07', '2000-08', '2000-09']
['2000-10', '2000-11', '2000-12']
['2001-01', '2001-02', '2001-03']
['2001-04', '2001-05', '2001-06']
['2001-07', '2001-08', '2001-09']
['2001-10', '2001-11', '2001-12']
['2002-01', '2002-02', '2002-03']
['2002-04', '2002-05', '2002-06']
['2002-07', '2002-08', '2002-09']
['2002-10', '2002-11', '2002-12']
['2003-01', '2003-02', '2003-03']
['2003-04', '2003-05', '2003-06']
['2003-07', '2003-08', '2003-09']
['2003-10', '2003-11', '2003-12']
['2004-01', '2004-02', '2004-03']
['2004-04', '2004-05', '2004-06']
['2004-07', '2004-08', '2004-09']
['2004-10', '2004-11', '2004-12']
['2005-01', '2005-02', '2005-03']
['2005-04', '2005-05', '2005-06']
['2005-07', '2005-08', '2005-09']
['2005-10', '2005-11', '2005-12']
['2006-01', '2006-02', '2006-03']
['2006-04', '2006-05', '2006-06']
['2006-07', '2006-08', '2006-09']
['2006-10', '2006-11', '2006-12']
['2007-01', '2007-02', '2007-03']
['2007-04', '2007-05', '2007-06']
['2007-07', '2007-08', '2007-09']
['2007-10', '2007-11', '2007-12']
['2008-01', '2008-02', '2008-03']
['2008-04', '2008-05', '2008-06']
['2008-07', '2008-08', '2008-09']
['2008-10', '2008-11', '2008-12']
['2009-01', '2009-02', '2009-03']
['2009-04', '2009-05', '2009-06']
['2009-07', '2009-08', '2009-09']
['2009-10', '2009-11', '2009-12']
['2010-01', '2010-02', '2010-03']
['2010-04', '2010-05', '2010-06']
['2010-07', '2010-08', '2010-09']
['2010-10', '2010-11', '2010-12']
['2011-01', '2011-02', '2011-03']
['2011-04', '2011-05', '2011-06']
['2011-07', '2011-08', '2011-09']
['2011-10', '2011-11', '2011-12']
['2012-01', '2012-02', '2012-03']
['2012-04', '2012-05', '2012-06']
['2012-07', '2012-08', '2012-09']
['2012-10', '2012-11', '2012-12']
['2013-01', '2013-02', '2013-03']
['2013-04', '2013-05', '2013-06']
['2013-07', '2013-08', '2013-09']
['2013-10', '2013-11', '2013-12']
['2014-01', '2014-02', '2014-03']
['2014-04', '2014-05', '2014-06']
['2014-07', '2014-08', '2014-09']
['2014-10', '2014-11', '2014-12']
['2015-01', '2015-02', '2015-03']
['2015-04', '2015-05', '2015-06']
['2015-07', '2015-08', '2015-09']
['2015-10', '2015-11', '2015-12']
['2016-01', '2016-02', '2016-03']
['2016-04', '2016-05', '2016-06']
['2016-07', '2016-08', '2016-09']
['2016-10', '2016-11', '2016-12']

In [341]:
homes.shape

(10730, 251)

In [342]:
i = 1
i += 2
i

3

In [34]:
# From previous function I will create a new dataframe.
#Previous  function will be iterate per row and it will return the data frame but with the new columns with the quarters

In [21]:
homes.iloc[0,:].get(["1926-01","1996-02","1996-08"])

1926-01    NaN
1996-02    NaN
1996-08    NaN
Name: 0, dtype: object

In [37]:
months = ['2009-04', '2009-05', '2009-06']
months1 = ['2016-07', '2016-08', '2016-09']
months2 = ['2016-10', '2016-11', '2016-12']

In [31]:
homes.columns.values

array(['RegionID', 'RegionName', 'State', 'Metro', 'CountyName',
       'SizeRank', '1996-04', '1996-05', '1996-06', '1996-07', '1996-08',
       '1996-09', '1996-10', '1996-11', '1996-12', '1997-01', '1997-02',
       '1997-03', '1997-04', '1997-05', '1997-06', '1997-07', '1997-08',
       '1997-09', '1997-10', '1997-11', '1997-12', '1998-01', '1998-02',
       '1998-03', '1998-04', '1998-05', '1998-06', '1998-07', '1998-08',
       '1998-09', '1998-10', '1998-11', '1998-12', '1999-01', '1999-02',
       '1999-03', '1999-04', '1999-05', '1999-06', '1999-07', '1999-08',
       '1999-09', '1999-10', '1999-11', '1999-12', '2000-01', '2000-02',
       '2000-03', '2000-04', '2000-05', '2000-06', '2000-07', '2000-08',
       '2000-09', '2000-10', '2000-11', '2000-12', '2001-01', '2001-02',
       '2001-03', '2001-04', '2001-05', '2001-06', '2001-07', '2001-08',
       '2001-09', '2001-10', '2001-11', '2001-12', '2002-01', '2002-02',
       '2002-03', '2002-04', '2002-05', '2002-06', '2002-07', '2002-08',
       '2002-09', '2002-10', '2002-11', '2002-12', '2003-01', '2003-02',
       '2003-03', '2003-04', '2003-05', '2003-06', '2003-07', '2003-08',
       '2003-09', '2003-10', '2003-11', '2003-12', '2004-01', '2004-02',
       '2004-03', '2004-04', '2004-05', '2004-06', '2004-07', '2004-08',
       '2004-09', '2004-10', '2004-11', '2004-12', '2005-01', '2005-02',
       '2005-03', '2005-04', '2005-05', '2005-06', '2005-07', '2005-08',
       '2005-09', '2005-10', '2005-11', '2005-12', '2006-01', '2006-02',
       '2006-03', '2006-04', '2006-05', '2006-06', '2006-07', '2006-08',
       '2006-09', '2006-10', '2006-11', '2006-12', '2007-01', '2007-02',
       '2007-03', '2007-04', '2007-05', '2007-06', '2007-07', '2007-08',
       '2007-09', '2007-10', '2007-11', '2007-12', '2008-01', '2008-02',
       '2008-03', '2008-04', '2008-05', '2008-06', '2008-07', '2008-08',
       '2008-09', '2008-10', '2008-11', '2008-12', '2009-01', '2009-02',
       '2009-03', '2009-04', '2009-05', '2009-06', '2009-07', '2009-08',
       '2009-09', '2009-10', '2009-11', '2009-12', '2010-01', '2010-02',
       '2010-03', '2010-04', '2010-05', '2010-06', '2010-07', '2010-08',
       '2010-09', '2010-10', '2010-11', '2010-12', '2011-01', '2011-02',
       '2011-03', '2011-04', '2011-05', '2011-06', '2011-07', '2011-08',
       '2011-09', '2011-10', '2011-11', '2011-12', '2012-01', '2012-02',
       '2012-03', '2012-04', '2012-05', '2012-06', '2012-07', '2012-08',
       '2012-09', '2012-10', '2012-11', '2012-12', '2013-01', '2013-02',
       '2013-03', '2013-04', '2013-05', '2013-06', '2013-07', '2013-08',
       '2013-09', '2013-10', '2013-11', '2013-12', '2014-01', '2014-02',
       '2014-03', '2014-04', '2014-05', '2014-06', '2014-07', '2014-08',
       '2014-09', '2014-10', '2014-11', '2014-12', '2015-01', '2015-02',
       '2015-03', '2015-04', '2015-05', '2015-06', '2015-07', '2015-08',
       '2015-09', '2015-10', '2015-11', '2015-12', '2016-01', '2016-02',
       '2016-03', '2016-04', '2016-05', '2016-06', '2016-07', '2016-08'], dtype=object)

In [42]:
if (any((True for x in homes.columns.values if x in months))):
        print("OK")
else:
    print("NOK")

if (any((True for x in homes.columns.values if x in months1))):
        print("OK")
else:
    print("NOK")
    
if (any((True for x in homes.columns.values if x in months2))):
        print("OK")
else:
    print("NOK")

OK
OK
NOK

In [44]:
homes.iloc[0,:].index

Index(['RegionID', 'RegionName', 'State', 'Metro', 'CountyName', 'SizeRank',
       '1996-04', '1996-05', '1996-06', '1996-07',
       ...
       '2015-11', '2015-12', '2016-01', '2016-02', '2016-03', '2016-04',
       '2016-05', '2016-06', '2016-07', '2016-08'],
      dtype='object', length=251)

In [62]:
#Pandas don't dispaly (sometimes) float values)
pd.options.display.float_format = '{:.2f}'.format
def get_quarters(row):
    new_row = row.loc[["RegionName","State"]]
    # Let's loop from 2000 to 2016
    for year in range(2000,2017):
        # Let's loop over the four quarters per year
        for quarter in range(0,4):
            #Let's loop over the 12/4 = 3 mothns per quarter
            months = [str(year)+"-"+str((quarter * 3) + month).zfill(2) for month in range(1,4)]
            # Check if this quarter need to be added
            if (any((True for x in row.index.values if x in months))):
                new_row[str(year) + "q" + str(quarter+1)] = row.get(months).mean(skipna=True)
                #print(type(new_row[str(year) + "q" + str(quarter+1)]))
                #print( row.get(months).mean(skipna=True))
    return new_row

In [34]:
get_quarters(homes.iloc[0,:])

RegionID          6181
RegionName    New York
State               NY
Metro         New York
CountyName      Queens
SizeRank             1
2000q1             NaN
2000q2             NaN
2000q3             NaN
2000q4             NaN
2001q1             NaN
2001q2             NaN
2001q3             NaN
2001q4             NaN
2002q1             NaN
2002q2             NaN
2002q3             NaN
2002q4             NaN
2003q1             NaN
2003q2             NaN
2003q3             NaN
2003q4             NaN
2004q1             NaN
2004q2             NaN
2004q3       435650.00
2004q4       432133.33
2005q1       422666.67
2005q2       431800.00
2005q3       438766.67
2005q4       464500.00
                ...
2009q3       455933.33
2009q4       458366.67
2010q1       469700.00
2010q2       476933.33
2010q3       478566.67
2010q4       477266.67
2011q1       476700.00
2011q2       472133.33
2011q3       469200.00
2011q4       463700.00
2012q1       460200.00
2012q2       462700.00
2012q3       467233.33
2012q4       469166.67
2013q1       469033.33
2013q2       472233.33
2013q3       481366.67
2013q4       492433.33
2014q1       503133.33
2014q2       515466.67
2014q3       522800.00
2014q4       528066.67
2015q1       532266.67
2015q2       540800.00
2015q3       557200.00
2015q4       572833.33
2016q1       582866.67
2016q2       591633.33
2016q3       587200.00
2016q4             NaN
Name: 0, dtype: object

In [63]:
 # Apply recession function to the dataframe by row
homes = homes.head(5).apply(get_quarters,axis = 1)

In [65]:
homes.head()

,RegionName,State,2000q1,2000q2,2000q3,2000q4,2001q1,2001q2,2001q3,2001q4,...,2014q2,2014q3,2014q4,2015q1,2015q2,2015q3,2015q4,2016q1,2016q2,2016q3
0,New York,NY,nan,nan,nan,nan,nan,nan,nan,nan,...,515466.67,522800.00,528066.67,532266.67,540800.00,557200.00,572833.33,582866.67,591633.33,587200.00
1,Los Angeles,CA,207066.67,214466.67,220966.67,226166.67,233000.00,239100.00,245066.67,253033.33,...,498033.33,509066.67,518866.67,528800.00,538166.67,547266.67,557733.33,566033.33,577466.67,584050.00
2,Chicago,IL,138400.00,143633.33,147866.67,152133.33,156933.33,161800.00,166400.00,170433.33,...,192633.33,195766.67,201266.67,201066.67,206033.33,208300.00,207900.00,206066.67,208200.00,212000.00
3,Philadelphia,PA,53000.00,53633.33,54133.33,54700.00,55333.33,55533.33,56266.67,57533.33,...,113733.33,115300.00,115666.67,116200.00,117966.67,121233.33,122200.00,123433.33,126933.33,128700.00
4,Phoenix,AZ,111833.33,114366.67,116000.00,117400.00,119600.00,121566.67,122700.00,124300.00,...,164266.67,165366.67,168500.00,171533.33,174166.67,179066.67,183833.33,187900.00,191433.33,195200.00

In [67]:
homes.set_index(["State","RegionName"])

,,2000q1,2000q2,2000q3,2000q4,2001q1,2001q2,2001q3,2001q4,2002q1,2002q2,...,2014q2,2014q3,2014q4,2015q1,2015q2,2015q3,2015q4,2016q1,2016q2,2016q3
State,RegionName,,,,,,,,,,,,,,,,,,,,,
NY,New York,nan,nan,nan,nan,nan,nan,nan,nan,nan,nan,...,515466.67,522800.00,528066.67,532266.67,540800.00,557200.00,572833.33,582866.67,591633.33,587200.00
CA,Los Angeles,207066.67,214466.67,220966.67,226166.67,233000.00,239100.00,245066.67,253033.33,261966.67,272700.00,...,498033.33,509066.67,518866.67,528800.00,538166.67,547266.67,557733.33,566033.33,577466.67,584050.00
IL,Chicago,138400.00,143633.33,147866.67,152133.33,156933.33,161800.00,166400.00,170433.33,175500.00,177566.67,...,192633.33,195766.67,201266.67,201066.67,206033.33,208300.00,207900.00,206066.67,208200.00,212000.00
PA,Philadelphia,53000.00,53633.33,54133.33,54700.00,55333.33,55533.33,56266.67,57533.33,59133.33,60733.33,...,113733.33,115300.00,115666.67,116200.00,117966.67,121233.33,122200.00,123433.33,126933.33,128700.00
AZ,Phoenix,111833.33,114366.67,116000.00,117400.00,119600.00,121566.67,122700.00,124300.00,126533.33,128366.67,...,164266.67,165366.67,168500.00,171533.33,174166.67,179066.67,183833.33,187900.00,191433.33,195200.00

In [13]:
def get_quarters(row):
    new_row = row.loc[["RegionName","State"]]
    # Let's loop from 2000 to 2016
    for year in range(2000,2017):
        # Let's loop over the four quarters per year
        for quarter in range(0,4):
            #Let's loop over the 12/4 = 3 mothns per quarter
            months = [str(year)+"-"+str((quarter * 3) + month).zfill(2) for month in range(1,4)]
            # Check if this quarter need to be added
            if (any((True for x in row.index.values if x in months))):
                new_row[str(year) + "q" + str(quarter+1)] = row.get(months).mean(skipna=True)
    return new_row 

def convert_housing_data_to_quarters():
    homes = pd.read_csv("City_Zhvi_AllHomes.csv")
    # Apply the ransfomration to moths to quarters
    homes = homes.apply(get_quarters,axis = 1)
    #SEt the new idnex
    return homes.set_index(["State","RegionName"])

Testing for get only the columns and the mean to generate the quarters

In [44]:
homes = pd.read_csv("City_Zhvi_AllHomes.csv")
hquarters = homes.loc[:,["RegionName","State"]]   
columns = ['2000-07', '2000-08', '2000-09']
quarter = "2000q1"
hquarters[quarter] = homes.get(columns).mean(skipna=True, axis = 1)
hquarters.head()

     RegionName State         2000q1
0      New York    NY            NaN
1   Los Angeles    CA  220966.666667
2       Chicago    IL  147866.666667
3  Philadelphia    PA   54133.333333
4       Phoenix    AZ  116000.000000

In [53]:
# This doesn't seems to work fine, like get in Series where even if a columns doesnt exist tihs will be ignored
columns1 = ['2016-01', '2016-02', '2016-03']
columns2 = ['2016-07', '2016-08', '2016-09']
columns3 = ['2016-10', '2016-11', '2016-12']
quarter = "2000q1"
hquarters[quarter] = homes.get(columns2)
hquarters.head()

     RegionName State 2000q1
0      New York    NY   None
1   Los Angeles    CA   None
2       Chicago    IL   None
3  Philadelphia    PA   None
4       Phoenix    AZ   None

In [64]:
def convert_housing_data_to_quarters():
    homes = pd.read_csv("City_Zhvi_AllHomes.csv")
    # Apply the ransfomration to moths to quarters
    hquarters = homes.loc[:,["RegionName","State"]]
    # Let's loop from 2000 to 2016
    for year in range(2000,2017):
        # Let's loop over the four quarters per year
        for quarter in range(0,4):
            #Let's loop over the 12/4 = 3 mothns per quarter
            columns = [str(year)+"-"+str((quarter * 3) + month).zfill(2) for month in range(1,4)]
            # Check if this quarter need to be added
            if (any((True for x in homes.columns.values if x in columns))):
                #Since get doesn't seems to work fine it the columns doesn't exist, check if a column need
                #to be added
                for column in columns:
                    if not column in homes.columns.values:
                        #Add the column with NaN values
                        homes[column] = np.nan
                hquarters[str(year) + "q" + str(quarter+1)] = homes.get(columns).mean(skipna=True, axis=1)
    # Map the states
    states = {'OH': 'Ohio', 'KY': 'Kentucky', 'AS': 'American Samoa', 'NV': 'Nevada', 'WY': 'Wyoming', 
              'NA': 'National', 'AL': 'Alabama', 'MD': 'Maryland', 'AK': 'Alaska', 'UT': 'Utah', 
              'OR': 'Oregon', 'MT': 'Montana', 'IL': 'Illinois', 'TN': 'Tennessee', 'DC': 'District of Columbia', 
              'VT': 'Vermont', 'ID': 'Idaho', 'AR': 'Arkansas', 'ME': 'Maine', 'WA': 'Washington', 
              'HI': 'Hawaii', 'WI': 'Wisconsin', 'MI': 'Michigan', 'IN': 'Indiana', 'NJ': 'New Jersey', 
              'AZ': 'Arizona', 'GU': 'Guam', 'MS': 'Mississippi', 'PR': 'Puerto Rico', 'NC': 'North Carolina', 
              'TX': 'Texas', 'SD': 'South Dakota', 'MP': 'Northern Mariana Islands', 'IA': 'Iowa',
              'MO': 'Missouri', 'CT': 'Connecticut', 'WV': 'West Virginia', 'SC': 'South Carolina',
              'LA': 'Louisiana', 'KS': 'Kansas', 'NY': 'New York', 'NE': 'Nebraska', 'OK': 'Oklahoma',
              'FL': 'Florida', 'CA': 'California', 'CO': 'Colorado', 'PA': 'Pennsylvania', 'DE': 'Delaware',
              'NM': 'New Mexico', 'RI': 'Rhode Island', 'MN': 'Minnesota', 'VI': 'Virgin Islands', 
              'NH': 'New Hampshire', 'MA': 'Massachusetts', 'GA': 'Georgia', 'ND': 'North Dakota', 'VA': 'Virginia'}
    hquarters["State"] = hquarters["State"].map(states)
    #Set the new idnex
    return hquarters.set_index(["State","RegionName"])

In [66]:
convert_housing_data_to_quarters().head()

,,2000q1,2000q2,2000q3,2000q4,2001q1,2001q2,2001q3,2001q4,2002q1,2002q2,...,2014q2,2014q3,2014q4,2015q1,2015q2,2015q3,2015q4,2016q1,2016q2,2016q3
State,RegionName,,,,,,,,,,,,,,,,,,,,,
New York,New York,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,515466.666667,522800.000000,528066.666667,532266.666667,540800.000000,557200.000000,572833.333333,582866.666667,591633.333333,587200.0
California,Los Angeles,207066.666667,214466.666667,220966.666667,226166.666667,233000.000000,239100.000000,245066.666667,253033.333333,261966.666667,272700.000000,...,498033.333333,509066.666667,518866.666667,528800.000000,538166.666667,547266.666667,557733.333333,566033.333333,577466.666667,584050.0
Illinois,Chicago,138400.000000,143633.333333,147866.666667,152133.333333,156933.333333,161800.000000,166400.000000,170433.333333,175500.000000,177566.666667,...,192633.333333,195766.666667,201266.666667,201066.666667,206033.333333,208300.000000,207900.000000,206066.666667,208200.000000,212000.0
Pennsylvania,Philadelphia,53000.000000,53633.333333,54133.333333,54700.000000,55333.333333,55533.333333,56266.666667,57533.333333,59133.333333,60733.333333,...,113733.333333,115300.000000,115666.666667,116200.000000,117966.666667,121233.333333,122200.000000,123433.333333,126933.333333,128700.0
Arizona,Phoenix,111833.333333,114366.666667,116000.000000,117400.000000,119600.000000,121566.666667,122700.000000,124300.000000,126533.333333,128366.666667,...,164266.666667,165366.666667,168500.000000,171533.333333,174166.666667,179066.666667,183833.333333,187900.000000,191433.333333,195200.0

In [67]:
convert_housing_data_to_quarters().loc["Texas"].loc["Austin"].loc["2010q3"]

202266.66666666666

In [68]:
def run_ttest():
    '''First creates new data showing the decline or growth of housing prices
    between the recession start and the recession bottom. Then runs a ttest
    comparing the university town values to the non-university towns values, 
    return whether the alternative hypothesis (that the two groups are the same)
    is true or not as well as the p-value of the confidence. 
    
    Return the tuple (different, p, better) where different=True if the t-test is
    True at a p<0.01 (we reject the null hypothesis), or different=False if 
    otherwise (we cannot reject the null hypothesis). The variable p should
    be equal to the exact p value returned from scipy.stats.ttest_ind(). The
    value for better should be either "university town" or "non-university town"
    depending on which has a lower mean price ratio (which is equivilent to a
    reduced market loss).'''
    
    return "ANSWER"

# Finally the last big answer

## Statistical Hypothesis

https://en.wikipedia.org/wiki/Statistical_hypothesis_testing

A **Statistical Hypothesis** is a hypothesis that is testable on the basis of observing a process that is modeled via a set of random variables.

A **statistical hypothesis test** is a method of statistical inference. Commonly, two statistical data sets are compared, or a data set obtained by sampling is compared against a synthetic data set from an idealized model. A hypothesis is proposed for the statistical relationship between the two data sets, and this is compared as an alternative to an idealized null hypothesis that proposes no relationship between two data sets.

The comparison is deemed statistically significant if the relationship between the data sets would be an unlikely realization of the null hypothesis according to a threshold probability—the significance level. 

**Hypothesis tests** are used in determining what outcomes of a study would lead to a **rejection** of the null hypothesis for a pre-specified **level of significance**. The process of distinguishing between the **null hypothesis** and the **alternative hypothesis **is aided by identifying **two conceptual types of errors** (type 1 & type 2), and by specifying parametric limits on e.g. how much type 1 error will be permitted.

An alternative framework for statistical hypothesis testing is to specify a set of statistical models, one for each candidate hypothesis, and then use model selection techniques to choose the most appropriate model.[2] The most common selection techniques are based on either Akaike information criterion or Bayes factor.

## Hypothesis test

A hypothesis test examines two opposing hypotheses about a population: the null hypothesis and the alternative hypothesis. How you set up these hypotheses depends on what you are trying to show.

- **Null hypothesis** (H0)

The null hypothesis states that a population parameter is equal to a value. The null hypothesis is often an initial claim that researchers specify using previous research or knowledge. 

- **Alternative Hypothesis** (H1)

The alternative hypothesis states that the population parameter is different than the value of the population parameter in the null hypothesis. The alternative hypothesis is what you might believe to be true or hope to prove true.

In [83]:
import pandas as pd
import numpy as np
from scipy.stats import ttest_ind

def get_list_of_university_towns():
    # Let's create a new variable for all the values
    towns = []
    # Read the file
    with open('university_towns.txt', 'r+') as file:
        state = "Unknown"
        # Read the 
        for line in file:
            if "[edit]" in line:
                state = line.split("[")[0].strip()
            else:
                # Get the country and store into the Dictionary for the dataframe
                towns.append([state, line.split("(")[0].strip()])
    # Create a dataframe using the data read
    return pd.DataFrame(towns, columns=["State", "RegionName"])

## Recession definition
def check_reccession(row):
    # By default the recesion is set to False
    result = False
    if (row["i-3"] < row["i-4"]) and (row["i-2"] < row["i-3"]):
        result = True
    # Set the final result 
    row["recession"] = result
    return row

def get_GDP():
    # Open the Excel file
    excel = pd.ExcelFile("gdplev.xls")
    # Form the first sheet only take the columns E and G with the quarter and chained GDP 
    GDP = excel.parse(excel.sheet_names[0],names=["QuarterYear","GDP"],skiprows=7, parse_cols="E,G")
    # Split the columns quarter year into year
    GDP["Year"] = GDP["QuarterYear"].map(lambda cell: cell.split("q")[0])
    # Convert to numeric (floa, integer or wathever) values from columns Year and Quarter
    GDP["Year"] = pd.to_numeric(GDP["Year"])
    GDP["GDP"] = pd.to_numeric(GDP["GDP"])
    # Filter the values from 2000 (we also need previous year to compute the recession for the first year)
    GDP = GDP[GDP["Year"] >= 1999]
    # Reset the index and delete the old one.
    GDP.reset_index(drop=True,inplace=True)
    # Create new columns with the last 4 quarters in order to cumpute the reccesion
    columns = ["i-4","i-3","i-2","i-1"]
    values = [[np.NaN,np.NaN,np.NaN,np.NaN]] * (len(GDP["GDP"]) )
    new_columns = pd.DataFrame(values, columns = columns)
    # Add to the columns the data from GDP
    for i in range(4, len(GDP["GDP"])):
        new_columns.ix[i, columns] = GDP["GDP"].iloc[i-4:i].values  
    #Merge the new columns with the GDO set from 2000	
    GDP = pd.concat([GDP,new_columns], axis = 1 )
    #Once both set have been merged, et the index
    GDP.set_index("QuarterYear", inplace=True)
    ## Let's create a new column with recession periods
    GDP["recession"] = False
    # Apply recession function to the dataframe by row
    return GDP.apply(check_reccession,axis = 1)

def get_recession_start():
    GDP = get_GDP()
    recGDP = GDP[GDP["recession"]==True]
    bottom = GDP.index.get_loc(recGDP["GDP"].argmin())
    return GDP.index[bottom- 3]
def get_recession_end():
    GDP = get_GDP()
    recGDP = GDP[GDP["recession"]==True]
    return recGDP["GDP"].argmax()
def get_recession_bottom():
    GDP = get_GDP()
    recGDP = GDP[GDP["recession"]==True]
    return recGDP["GDP"].argmin()

def convert_housing_data_to_quarters():
    homes = pd.read_csv("City_Zhvi_AllHomes.csv")
    # Apply the ransfomration to moths to quarters
    hquarters = homes.loc[:,["RegionName","State"]]
    # Let's loop from 2000 to 2016
    for year in range(2000,2017):
        # Let's loop over the four quarters per year
        for quarter in range(0,4):
            #Let's loop over the 12/4 = 3 mothns per quarter
            columns = [str(year)+"-"+str((quarter * 3) + month).zfill(2) for month in range(1,4)]
            # Check if this quarter need to be added
            if (any((True for x in homes.columns.values if x in columns))):
                #Since get doesn't seems to work fine it the columns doesn't exist, check if a column need
                #to be added
                for column in columns:
                    if not column in homes.columns.values:
                        #Add the column with NaN values
                        homes[column] = np.nan
                hquarters[str(year) + "q" + str(quarter+1)] = homes.get(columns).mean(skipna=True, axis=1)
    # Map the states
    states = {'OH': 'Ohio', 'KY': 'Kentucky', 'AS': 'American Samoa', 'NV': 'Nevada', 'WY': 'Wyoming', 
              'NA': 'National', 'AL': 'Alabama', 'MD': 'Maryland', 'AK': 'Alaska', 'UT': 'Utah', 
              'OR': 'Oregon', 'MT': 'Montana', 'IL': 'Illinois', 'TN': 'Tennessee', 'DC': 'District of Columbia', 
              'VT': 'Vermont', 'ID': 'Idaho', 'AR': 'Arkansas', 'ME': 'Maine', 'WA': 'Washington', 
              'HI': 'Hawaii', 'WI': 'Wisconsin', 'MI': 'Michigan', 'IN': 'Indiana', 'NJ': 'New Jersey', 
              'AZ': 'Arizona', 'GU': 'Guam', 'MS': 'Mississippi', 'PR': 'Puerto Rico', 'NC': 'North Carolina', 
              'TX': 'Texas', 'SD': 'South Dakota', 'MP': 'Northern Mariana Islands', 'IA': 'Iowa',
              'MO': 'Missouri', 'CT': 'Connecticut', 'WV': 'West Virginia', 'SC': 'South Carolina',
              'LA': 'Louisiana', 'KS': 'Kansas', 'NY': 'New York', 'NE': 'Nebraska', 'OK': 'Oklahoma',
              'FL': 'Florida', 'CA': 'California', 'CO': 'Colorado', 'PA': 'Pennsylvania', 'DE': 'Delaware',
              'NM': 'New Mexico', 'RI': 'Rhode Island', 'MN': 'Minnesota', 'VI': 'Virgin Islands', 
              'NH': 'New Hampshire', 'MA': 'Massachusetts', 'GA': 'Georgia', 'ND': 'North Dakota', 'VA': 'Virginia'}
    hquarters["State"] = hquarters["State"].map(states)
    #Set the new idnex
    return hquarters.set_index(["State","RegionName"])

First **creates** new data showing the **decline** or **growth** of **housing prices** between the **recession start** and the **recession bottom**. 

Then runs a **ttest** comparing the **university town values** to the **non-university towns values**, return whether the alternative hypothesis (that the two groups are the same) is true or not as well as the **p-value** of the confidence.

- Null Hypothesis (H0) = University town values
- Alternative Hypothesis (H1) = Non-university towns values

Let's get the decline or growth of housing prices by substracting the prices from the bottom of the recession to the starting.

In [104]:
#Let's
fromDate = get_recession_start()
toDate = get_recession_bottom()
print ("From {0} to {1}".format(fromDate,toDate))

From 2008q3 to 2009q2

In [119]:
housing = convert_housing_data_to_quarters()
housing = housing.loc[:, fromDate:toDate]
housing["Ratio"] = housing.loc[:, toDate] - housing.loc[:, fromDate] 
housing.shape

(10730, 5)

In [158]:
housing.head()

,,2008q3,2008q4,2009q1,2009q2,Ratio
State,RegionName,,,,,
New York,New York,499766.666667,487933.333333,477733.333333,465833.333333,-33933.333333
California,Los Angeles,469500.000000,443966.666667,426266.666667,413900.000000,-55600.000000
Illinois,Chicago,232000.000000,227033.333333,223766.666667,219700.000000,-12300.000000
Pennsylvania,Philadelphia,116933.333333,115866.666667,116200.000000,116166.666667,-766.666667
Arizona,Phoenix,193766.666667,183333.333333,177566.666667,168233.333333,-25533.333333

In [159]:
housing.shape

(10730, 5)

In [148]:
housing.loc["New York",:].head()

,2008q3,2008q4,2009q1,2009q2,Ratio
RegionName,,,,,
New York,499766.666667,487933.333333,477733.333333,465833.333333,-33933.333333
Rochester,58933.333333,59100.000000,58500.000000,58200.000000,-733.333333
Yonkers,456366.666667,445500.000000,434900.000000,429300.000000,-27066.666667
Syracuse,76900.000000,76900.000000,75400.000000,75033.333333,-1866.666667
Town of Greece,115466.666667,114966.666667,113300.000000,113100.000000,-2366.666667

Now we have to divide the current series beween the housin in univeristy towns and the non university towns

- University town: inner merge between the univeristy town dataframe to this one.
- Non University town: outer merge between the univeristy town dataframe to this one.

Get the Universisty towns

In [123]:
UTowns = get_list_of_university_towns()
UTowns.shape

(517, 2)

In [136]:
UTowns.head()

     State    RegionName
0  Alabama        Auburn
1  Alabama      Florence
2  Alabama  Jacksonville
3  Alabama    Livingston
4  Alabama    Montevallo

In [149]:
UTowns[UTowns["State"] == "New York"].head()

        State  RegionName
276  New York      Alfred
277  New York      Albany
278  New York      Aurora
279  New York  Binghamton
280  New York   Brockport

In [151]:
?pd.merge

In [142]:
inUTowns = pd.merge(housing,UTowns,how='inner',left_index=True,right_on=["State","RegionName"])
inUTowns.shape

(269, 7)

In [130]:
inUTowns.head()

,2008q3,2008q4,2009q1,2009q2,Ratio,State,RegionName
252,213366.666667,194933.333333,181200.000000,164333.333333,-49033.333333,Nevada,Las Vegas
38,424666.666667,407633.333333,395700.000000,389500.000000,-35166.666667,California,San Diego
450,112166.666667,109900.000000,107666.666667,105100.000000,-7066.666667,Texas,Dallas
445,211033.333333,207466.666667,207000.000000,204000.000000,-7033.333333,Texas,Austin
335,112200.000000,111600.000000,110966.666667,109766.666667,-2433.333333,Ohio,Columbus

In [ ]:
inUTowns.set_index(["State","RegionName"],inplace = True)

In [155]:
inUTowns.head()

                              2008q3         2008q4         2009q1  \
State      RegionName
Nevada     Las Vegas   213366.666667  194933.333333  181200.000000
California San Diego   424666.666667  407633.333333  395700.000000
Texas      Dallas      112166.666667  109900.000000  107666.666667
           Austin      211033.333333  207466.666667  207000.000000
Ohio       Columbus    112200.000000  111600.000000  110966.666667

                              2009q2         Ratio
State      RegionName
Nevada     Las Vegas   164333.333333 -49033.333333
California San Diego   389500.000000 -35166.666667
Texas      Dallas      105100.000000  -7066.666667
           Austin      204000.000000  -7033.333333
Ohio       Columbus    109766.666667  -2433.333333

In [156]:
inUTowns.shape

(269, 5)

In [180]:
noUTowns = pd.merge(housing,UTowns,how='outer',left_index=True,right_on=["State","RegionName"], indicator=True)

In [174]:
noUTowns.head()

,2008q3,2008q4,2009q1,2009q2,Ratio,State,RegionName,_merge
516,499766.666667,487933.333333,477733.333333,465833.333333,-33933.333333,New York,New York,left_only
516,469500.000000,443966.666667,426266.666667,413900.000000,-55600.000000,California,Los Angeles,left_only
516,232000.000000,227033.333333,223766.666667,219700.000000,-12300.000000,Illinois,Chicago,left_only
516,116933.333333,115866.666667,116200.000000,116166.666667,-766.666667,Pennsylvania,Philadelphia,left_only
516,193766.666667,183333.333333,177566.666667,168233.333333,-25533.333333,Arizona,Phoenix,left_only

In [175]:
noUTowns.shape

(10979, 8)

In [178]:
noUTowns[noUTowns._merge == 'left_only'].head()

,2008q3,2008q4,2009q1,2009q2,Ratio,State,RegionName,_merge
516,499766.666667,487933.333333,477733.333333,465833.333333,-33933.333333,New York,New York,left_only
516,469500.000000,443966.666667,426266.666667,413900.000000,-55600.000000,California,Los Angeles,left_only
516,232000.000000,227033.333333,223766.666667,219700.000000,-12300.000000,Illinois,Chicago,left_only
516,116933.333333,115866.666667,116200.000000,116166.666667,-766.666667,Pennsylvania,Philadelphia,left_only
516,193766.666667,183333.333333,177566.666667,168233.333333,-25533.333333,Arizona,Phoenix,left_only

In [182]:
noUTowns = noUTowns[noUTowns._merge == 'left_only']

In [183]:
noUTowns.shape

(10461, 8)

In [184]:
noUTowns.set_index(["State","RegionName"],inplace = True)

In [185]:
noUTowns.head()

,,2008q3,2008q4,2009q1,2009q2,Ratio,_merge
State,RegionName,,,,,,
New York,New York,499766.666667,487933.333333,477733.333333,465833.333333,-33933.333333,left_only
California,Los Angeles,469500.000000,443966.666667,426266.666667,413900.000000,-55600.000000,left_only
Illinois,Chicago,232000.000000,227033.333333,223766.666667,219700.000000,-12300.000000,left_only
Pennsylvania,Philadelphia,116933.333333,115866.666667,116200.000000,116166.666667,-766.666667,left_only
Arizona,Phoenix,193766.666667,183333.333333,177566.666667,168233.333333,-25533.333333,left_only

In [ ]:
noUTowns = noUTowns.drop("_merge",axis = 1)

In [191]:
noUTowns.shape

(10461, 5)

In [198]:
inUTowns.shape

(269, 5)

In [203]:
t, p = ttest_ind(inUTowns.Ratio.values, noUTowns.Ratio.values, equal_var=False)

In [3]:
?ttest_ind

## Following hypothesis explanation is the key one.

**Hypothesis**: University towns have their mean housing prices less affected by recessions. We run a t-test to compare the ratio of the mean price of houses in university towns the quarter before the recession starts compared to the recession bottom. (price_ratio=quarter_before_recession/recession_bottom)

http://danielbreen.net/projects/housing_prices_college_towns/

In [48]:
#Let's get the columns where the recession star and the bottom
fromDate = get_recession_start()
toDate = get_recession_end()

# In the example takes the date of the end of the recession insted.. we will try.
#  toDate = get_recession_bottom()

# Get the housing data and the university towns
data = convert_housing_data_to_quarters()
towns = get_list_of_university_towns()

#Let's use the same index as the data for the university Towns dataframe
towns.set_index(["State","RegionName"],inplace = True)

#Compute the ratio housing prices from the bottom to the start recession period
data = data.loc[:, fromDate:toDate]
data["ratio"] = data.loc[:, fromDate] / data.loc[:, toDate]

In [49]:
towns.head()

Empty DataFrame
Columns: []
Index: [(Alabama, Auburn), (Alabama, Florence), (Alabama, Jacksonville), (Alabama, Livingston), (Alabama, Montevallo)]

In [50]:
data.head()

,,2008q3,2008q4,2009q1,2009q2,2009q3,2009q4,ratio
State,RegionName,,,,,,,
New York,New York,499766.666667,487933.333333,477733.333333,465833.333333,455933.333333,458366.666667,1.090321
California,Los Angeles,469500.000000,443966.666667,426266.666667,413900.000000,406366.666667,404333.333333,1.161171
Illinois,Chicago,232000.000000,227033.333333,223766.666667,219700.000000,214100.000000,211666.666667,1.096063
Pennsylvania,Philadelphia,116933.333333,115866.666667,116200.000000,116166.666667,116733.333333,118566.666667,0.986224
Arizona,Phoenix,193766.666667,183333.333333,177566.666667,168233.333333,155933.333333,143466.666667,1.350604

In [51]:
print(data.shape)
print(towns.shape)

(10730, 7)
(517, 0)

In [52]:
dataRatio  = data["ratio"].dropna()

In [53]:
dataRatio.shape

(9884,)

In [54]:
#Get the universisty towns
university = pd.merge(data,towns,how='inner',left_index=True,right_index=True)

In [55]:
university.head()

                           2008q3         2008q4         2009q1  \
State   RegionName
Alabama Montevallo  127266.666667  125800.000000  124033.333333
        Tuscaloosa  139600.000000  140100.000000  139133.333333
Alaska  Fairbanks   249966.666667  242900.000000  234966.666667
Arizona Flagstaff   322633.333333  318733.333333  309400.000000
        Tempe       228133.333333  219766.666667  214666.666667

                           2009q2         2009q3         2009q4     ratio
State   RegionName
Alabama Montevallo  125200.000000  122666.666667  124133.333333  1.025242
        Tuscaloosa  136933.333333  137233.333333  136533.333333  1.022461
Alaska  Fairbanks   225833.333333  225766.666667  224033.333333  1.115757
Arizona Flagstaff   299600.000000  290900.000000  284000.000000  1.136033
        Tempe       207500.000000  196300.000000  189133.333333  1.206204

In [56]:
university.shape

(269, 7)

In [57]:
non_university = pd.merge(data, towns,how='outer',left_index=True, right_index=True, indicator=True)

In [58]:
non_university.head()

                            2008q3         2008q4         2009q1  \
State   RegionName
Alabama Adamsville    84866.666667   85833.333333   85433.333333
        Alabaster    155333.333333  153200.000000  150533.333333
        Albertville   85333.333333   83766.666667   84200.000000
        Arab         108933.333333  107933.333333  113600.000000
        Ardmore      149100.000000  151200.000000  147133.333333

                            2009q2         2009q3         2009q4     ratio  \
State   RegionName
Alabama Adamsville    85766.666667   84766.666667   82933.333333  1.023312
        Alabaster    149666.666667  149600.000000  149266.666667  1.040643
        Albertville   84333.333333   84666.666667   86900.000000  0.981972
        Arab         115366.666667  113533.333333  110733.333333  0.983745
        Ardmore      143900.000000  142800.000000  142466.666667  1.046561

                        _merge
State   RegionName
Alabama Adamsville   left_only
        Alabaster    left_only
        Albertville  left_only
        Arab         left_only
        Ardmore      left_only

In [59]:
non_university.shape

(10979, 8)

In [61]:
non_university = non_university[non_university._merge == 'left_only']

In [63]:
non_university.shape

(10461, 8)

In [76]:
# In order to delete the indicator columns
#noUTowns = non_university.drop("_merge",axis = 1)

In [79]:
values_university = university["ratio"].dropna()
print (values_university.shape)
values_non_university = non_university["ratio"].dropna()
print (values_non_university.shape)

(258,)
(9626,)

In [73]:
statistic, p_value = tuple(ttest_ind(university["ratio"].dropna(), non_university["ratio"].dropna()))

In [74]:
statistic

-3.0622180432091022

In [80]:
p_value

0.0022029387845876542

In [82]:
outcome = statistic < 0
    
different = p_value < 0.05
    
better = ["non-university town", "university town"]
    
(different, p_value, better[outcome])

(True, 0.0022029387845876542, 'university town')

In [91]:
def run_ttest():
    #Let's get the columns where the recession star and the bottom
    fromDate = get_recession_start()
    toDate = get_recession_end()
    # Get the housing data and the university towns
    data = convert_housing_data_to_quarters()
    towns = get_list_of_university_towns()
    #Let's use the same index as the data for the university Towns dataframe
    towns.set_index(["State","RegionName"],inplace = True)
    #Compute the ratio housing prices from the bottom to the start recession period
    data = data.loc[:, fromDate:toDate]
    data["ratio"] = data.loc[:, fromDate] / data.loc[:, toDate] 
    #Get the universisty towns
    university = pd.merge(data,towns,how='inner',left_index=True,right_index=True)
    #Left outter join
    non_university = pd.merge(data, towns,how='outer',left_index=True, right_index=True, indicator=True)
    non_university = non_university[non_university._merge == 'left_only']
    #Call to ttest                                
    statistic, p_value = tuple(ttest_ind(university["ratio"].dropna(), non_university["ratio"].dropna()))
    outcome = statistic < 0
    different = p_value < 0.05
    better = ["non-university town", "university town"]
    return (different, p_value, better[outcome])

In [92]:
run_ttest()

(True, 0.0022029387845876542, 'university town')